In [29]:
# The %... is an iPython thing, and is not part of the Python language.
# In this case we're just telling the plotting library to draw things on
# the notebook, instead of on a separate window.
%matplotlib inline
# See all the "as ..." contructs? They're just aliasing the package names.
# That way we can call methods like plt.plot() instead of matplotlib.pyplot.plot().
import numpy as np
import scipy as sp
import matplotlib as mpl
import matplotlib.cm as cm
import matplotlib.pyplot as plt
import pandas as pd
import time
pd.set_option('display.width', 500)
pd.set_option('display.max_columns', 100)
pd.set_option('display.notebook_repr_html', True)
import seaborn as sns
sns.set_style("whitegrid")
sns.set_context("poster")

In [42]:
ourschema="""
DROP TABLE IF EXISTS "dbo.Provider";
DROP TABLE IF EXISTS "dbo.People";
CREATE TABLE "dbo.Provider" (
    "ID" INTEGER PRIMARY KEY  NOT NULL ,
    "Name" VARCHAR,
    "ServiceType" VARCHAR
);
CREATE TABLE "dboPeople" (
    "ID" INTEGER PRIMARY KEY  AUTOINCREMENT  NOT NULL,
    "FirstName" VARCHAR,
    "LastName" VARCHAR,
    "DOB" DATETIME,
    "Provider" INTEGER NOT NULL,
    FOREIGN KEY(Provider) REFERENCES dboProvider(ID)
);
"""

In [43]:
from sqlite3 import dbapi2 as sq3
import os
PATHSTART="."
def get_db(dbfile):
    sqlite_db = sq3.connect(os.path.join(PATHSTART, dbfile))
    return sqlite_db

In [44]:
def init_db(dbfile, schema):
    """Creates the database tables."""
    db = get_db(dbfile)
    db.cursor().executescript(schema)
    db.commit()
    return db

In [45]:
dfPeople=pd.read_csv("C:/Users/502689880/dbo.People.txt", sep='|')
dfPeople

    ID  FirstName     LastName         DOB  Provider
0    1       John        Jones  1980-04-03         3
1    2     Marsha        Jones  1981-05-01         3
2    3        Bob      Daniels  1977-07-25         2
3    4     Cherry         Hill  1984-03-26         1
4    5  Nathaniel       Bosley  1990-01-01         8
5    6      Jorge    Rodriguez  1987-10-28         7
6    7   Theodore        James  1985-06-22         6
7    8        Eva      Herring  1976-01-12         5
8    9    Loretta        Smith  1956-05-23         4
9   10       Joey       McDade  1975-11-02         3
10  11      Monte  Christopher  1982-08-16         2
11  12      Davis      McLovin  1988-02-24         1
12  13    Arianne       Dayton  1992-07-12         1
13  14       Zane         Cook  1977-09-30         1
14  15      Corey    Underwood  1983-02-13         2

In [46]:
dfProvider=pd.read_csv("C:/Users/502689880/dbo.Provider.txt", sep="|")
dfProvider.head()

   ID          Name ServiceType
0   1       Netflix   Streaming
1   2  Amazon Prime   Streaming
2   3       Comcast       Cable
3   4     Direct TV    Satelite
4   5       Charter       Cable

In [47]:
db=init_db("peopleprovider.db", ourschema)

In [48]:
dfProvider.to_sql("Provider", db, if_exists="append", index=False)

In [49]:
dfPeople.to_sql("People", db, if_exists="append", index=False)

In [50]:
dfPeople.shape

(15, 5)

In [53]:
sel="""
SELECT * FROM Provider;
"""
c=db.cursor().execute(sel)

In [54]:
c.fetchall()

[(1, 'Netflix', 'Streaming'),
 (2, 'Amazon Prime', 'Streaming'),
 (3, 'Comcast', 'Cable'),
 (4, 'Direct TV', 'Satelite'),
 (5, 'Charter', 'Cable'),
 (6, 'Wow', 'Cable'),
 (7, 'Dish', 'Satelite'),
 (8, 'Hulu', 'Streaming')]

In [55]:
rem="""
DELETE FROM Provider;
"""
c=db.cursor().execute(rem)
db.commit()

In [56]:
c.fetchall()

[]

In [57]:
ins="""
INSERT INTO Provider (ID, Name, ServiceType) \
    VALUES (?,?,?);
"""
with open("dbo.Provider.txt") as fd:
    slines =[l.strip().split('|') for l in fd.readlines()]
    for line in slines[1:]:
        theID, Name, ServiceType = line
        print (theID, Name, ServiceType)
        valstoinsert = (int(theID), Name, ServiceType)
        print (ins, valstoinsert)
        db.cursor().execute(ins, valstoinsert)

1 Netflix Streaming

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (1, 'Netflix', 'Streaming')
2 Amazon Prime Streaming

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (2, 'Amazon Prime', 'Streaming')
3 Comcast Cable

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (3, 'Comcast', 'Cable')
4 Direct TV Satelite

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (4, 'Direct TV', 'Satelite')
5 Charter Cable

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (5, 'Charter', 'Cable')
6 Wow Cable

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (6, 'Wow', 'Cable')
7 Dish Satelite

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (7, 'Dish', 'Satelite')
8 Hulu Streaming

INSERT INTO Provider (ID, Name, ServiceType)     VALUES (?,?,?);
 (8, 'Hulu', 'Streaming')

In [58]:
def make_query(sel):
    c=db.cursor().execute(sel)
    return c.fetchall()

In [59]:
make_query("SELECT * FROM Provider;")

[(1, 'Netflix', 'Streaming'),
 (2, 'Amazon Prime', 'Streaming'),
 (3, 'Comcast', 'Cable'),
 (4, 'Direct TV', 'Satelite'),
 (5, 'Charter', 'Cable'),
 (6, 'Wow', 'Cable'),
 (7, 'Dish', 'Satelite'),
 (8, 'Hulu', 'Streaming')]

In [62]:
cont_cols = [e[1] for e in make_query("PRAGMA table_info(People);")]
cont_cols

['ID', 'FirstName', 'LastName', 'DOB', 'Provider']

In [63]:
def make_frame(list_of_tuples, legend=cont_cols):
    framelist=[]
    for i, cname in enumerate(legend):
        framelist.append((cname,[e[i] for e in list_of_tuples]))
    return pd.DataFrame.from_items(framelist)

In [68]:
explicitjoinsel="""
SELECT 
    COUNT(People.ID), Provider.ServiceType 
FROM 
    People JOIN Provider 
ON People.Provider = Provider.ID
WHERE Provider.ServiceType='Streaming'
GROUP BY Provider.ServiceType;
"""
out=make_query(explicitjoinsel)
make_frame(out, legend=["count(People.ID)", 
            "Provider.ServiceType"])

   count(People.ID) Provider.ServiceType
0                 8            Streaming